УРВ_файловая/src/DataProcessors/РасписаниеЛК/РасписаниеЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасписаниеЛК</name>
  <attributes>
    <name>ТолькоПоСотруднику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЛегенду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКолонкиДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоСотрудникам</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеДействия</name>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасписания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ПользователиСервисов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТемаВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияЭлементаРасписанияЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.РезультатыКонсультации</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаписи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйСтатус</name>
      <type>
        <types>EnumRef.ИтоговыеСтатусыРасписанияЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистраторЗаписи</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистраторРезультата</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветТекста</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноДляСамозаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрочнаяЗапись</name>
      <comment>Срочная запись (Перенести при возможности на более ранний срок)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписи</name>
      <type>
        <types>EnumRef.ТипыЗаписейЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайнийСрок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьЗамещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеТелефоны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РаботаНазвание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УРВ_файловая/src/InformationRegisters/СвойстваЭлементовРасписанияЛК/СвойстваЭлементовРасписанияЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваЭлементовРасписанияЛК</name>
  <resources>
    <name>ДоступноДляСамозаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/РезультатыКонсультации/РезультатыКонсультации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыКонсультации</name>
  <enumValues>
    <name>ОказанаКонсультация</name>
  </enumValues>
  <enumValues>
    <name>НеОказанаКонсультация</name>
  </enumValues>
  <enumValues>
    <name>ВыполненаРабота</name>
  </enumValues>
  <enumValues>
    <name>НеВыполненаРабота</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/Documents/Обращение/Обращение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Обращение</name>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <registerRecords>InformationRegister.ГолосаПользователейЗаПожелания</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияОбращений</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентОбслуживающейОрганизации</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляПереписки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.КаналыПолученияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаБазыЗнаний</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.КомпонентыСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПрикрепилКарточку</name>
    <comment>Пользователь, который прикрепил к обращению карточку базы знаний</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСокращенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжиданиеОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпискаНаТариф</name>
    <type>
      <types>DocumentRef.Подписка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученНовыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннееОбращение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнутренними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнешними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбращенияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеОбращения</name>
    <attributes>
      <name>Обращение</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Catalogs/КаналыПолученияОбращений/КаналыПолученияОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаналыПолученияОбращений</name>
  <predefined>
    <items>
      <name>ИнформационныйЦентр</name>
      <description>Информационный центр</description>
    </items>
    <items>
      <name>РасписаниеЛК</name>
      <description>Расписание ЛК</description>
    </items>
    <items>
      <name>ТелефонГорячейЛинии</name>
      <description>Телефон &quot;Горячей линии&quot;</description>
    </items>
    <items>
      <name>ЭлектроннаяПочта</name>
      <description>Электронная почта</description>
    </items>
  </predefined>
</mdclass:Catalog>

УРВ_файловая/src/DataProcessors/РасписаниеЛК/Forms/ФормаОбработкиЗапланировано/Module.bsl
#Область Обработка_Описания
&НаКлиенте
Процедура ОписаниеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		СтандартнаяОбработка = Ложь;
		ЗапуститьПриложение(ДанныеСобытия.Href);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеФДПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.ЗавернутьФорматированныйДокументВ_XML(ОписаниеФД, ОписаниеXML);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписание(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОписаниеXML"					, ОписаниеXML);
	
	ДополнительныеПараметры = Новый Структура;
	
	ИмяФормыДляОткрытия = "Обработка.РасписаниеЛК.Форма.ФормаВводаОписания";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "РедактироватьОписание_Завершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписание_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	ОписаниеXML	= Результат.ОписаниеXML;
	БоР_ОбщийМодульКлиентСервер.РазвернутьФорматированныйДокументИзXML(ОписаниеXML, ОписаниеФД, ОписаниеHTML);
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БоР_ОбщийМодуль.ЗаполнитьРеквизитыИзПараметров(ЭтаФорма, Неопределено);
	БоР_ОбщийМодульКлиентСервер.РазвернутьФорматированныйДокументИзXML(ОписаниеXML, ОписаниеФД, ОписаниеHTML);
	УстановитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(ЭтаФорма)
	РаботаПоРасписанию			= БоР_ОбщийМодуль.ПолучитьПолеОбъекта(ЭтаФорма.ИсходнаяСтруктура.Работа, "РаботаПоРасписанию");
	ТребуетВыполнения			= БоР_ОбщийМодуль.ПолучитьПолеОбъекта(ЭтаФорма.ИсходнаяСтруктура.Работа, "ТребуетВыполнения");
	ЭтаФорма.Элементы.УстановитьДоступноДляСамозаписи	.Видимость		= Не ЭтаФорма.ИсходнаяСтруктура.ДоступноДляСамозаписи И РаботаПоРасписанию;
	ЭтаФорма.Элементы.СнятьДоступноДляСамозаписи		.Видимость		= ЭтаФорма.ИсходнаяСтруктура.ДоступноДляСамозаписи И РаботаПоРасписанию;
	ЭтаФорма.Элементы.ЗаписатьКлиента					.Видимость		= РаботаПоРасписанию;
	ЭтаФорма.Элементы.ПеренестиСрочнуюЗапись			.Видимость		= РаботаПоРасписанию;
	ЭтаФорма.Элементы.ОтразитьВыполнение				.Видимость		= Не РаботаПоРасписанию И ТребуетВыполнения;
	ЭтаФорма.Элементы.Продолжительность					.ТолькоПросмотр	= РаботаПоРасписанию;
	ЭтаФорма.Элементы.ДатаВремяОкончания				.ТолькоПросмотр	= РаботаПоРасписанию;
	
	
	
	ЭтаФорма.Элементы.ЗаписатьКлиента					.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступноИзменение;
	ЭтаФорма.Элементы.Перепланировать					.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступноПерепланирование;
	ЭтаФорма.Элементы.ПеренестиСрочнуюЗапись			.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступноПерепланирование;
	ЭтаФорма.Элементы.ЗаблокироватьЗапись				.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступноБлокировка;
	ЭтаФорма.Элементы.Освободить						.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступноОтменаБлокировки;
	ЭтаФорма.Элементы.УстановитьДоступноДляСамозаписи	.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступныВсеДействия;
	ЭтаФорма.Элементы.СнятьДоступноДляСамозаписи		.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступныВсеДействия;
	//Лобашова 30.05.2019 87280 +
	Если ЭтаФорма.ДоступныеДействия.ДоступноПросмотрДругихСотрудников Тогда
		ЭтаФорма.Элементы.ОтразитьВыполнение				.Доступность	= ЭтаФорма.ДоступныеДействия.ДоступноСоздание;
	КонецЕсли;
	//Лобашова 30.05.2019 87280 -
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКлиента(Команда)
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("Сотрудник"				, Сотрудник);
	СтруктураЭлемента.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СтруктураЭлемента.Вставить("ИсходнаяСтруктура"		, ИсходнаяСтруктура);
	СтруктураЭлемента.Вставить("Работа"					, Работа);
	СтруктураЭлемента.Вставить("Проект"					, Проект);
	СтруктураЭлемента.Вставить("Автор"					, Автор);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПутьКМетаданнымОбработки", ПутьКМетаданнымОбработки);
	БоР_ОбщийМодульКлиентСервер.ДополнитьСтруктуру(ПараметрыФормы, СтруктураЭлемента);
	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = ПутьКМетаданнымОбработки + ".Форма.ФормаЗаписиКлиента";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "ЗаписатьКлиента_Завершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКлиента_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если СтруктураВозВрата = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	Если Не СтруктураВозВрата.Свойство("РезультатОткрытия") Тогда
		ВозВрат;
	КонецЕсли;
	Если СтруктураВозВрата.РезультатОткрытия <> Истина Тогда
		ВозВрат;
	КонецЕсли;
	Закрыть(СтруктураВозВрата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьЗапись(Команда)
	
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Сотрудник"				, Сотрудник);
	ДанныеСотрудника.Вставить("Слоты"					, Новый Массив);
	
	СвойстваСлота = Новый Структура;
	СвойстваСлота.Вставить("Сотрудник"				, Сотрудник);
	СвойстваСлота.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СвойстваСлота.Вставить("ДатаВремяОкончания"		, ДатаВремяОкончания);
	СвойстваСлота.Вставить("Продолжительность"		, Продолжительность);
	СвойстваСлота.Вставить("ОписаниеXML"			, ОписаниеXML);
			
	ДанныеСотрудника.Слоты.Добавить(СвойстваСлота);
	
	ДанныеСлотов = Новый Массив;
	ДанныеСлотов.Добавить(ДанныеСотрудника);
	
	Адрес_ДанныеСлотов = ПоместитьВоВременноеХранилище(ДанныеСлотов, ЭтаФорма.УникальныйИдентификатор);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес_ДанныеСлотов"		, Адрес_ДанныеСлотов);
	ПараметрыФормы.Вставить("ПутьКМетаданнымОбработки"	, ПутьКМетаданнымОбработки);

	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = ПутьКМетаданнымОбработки + ".Форма.ФормаБлокировки";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "ЗаблокироватьЗапись_Завершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьЗапись_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если СтруктураВозВрата = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	Если Не СтруктураВозВрата.Свойство("РезультатОткрытия") Тогда
		ВозВрат;
	КонецЕсли;
	Если СтруктураВозВрата.РезультатОткрытия <> Истина Тогда
		ВозВрат;
	КонецЕсли;
	Закрыть(СтруктураВозВрата);

КонецПроцедуры

&НаКлиенте
Процедура Освободить(Команда)
	
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Сотрудник"				, Сотрудник);
	ДанныеСотрудника.Вставить("Слоты"					, Новый Массив);
	
	СвойстваСлота = Новый Структура;
	СвойстваСлота.Вставить("Сотрудник"				, Сотрудник);
	СвойстваСлота.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СвойстваСлота.Вставить("ДатаВремяОкончания"		, ДатаВремяОкончания);
	СвойстваСлота.Вставить("Продолжительность"		, Продолжительность);
			
	ДанныеСотрудника.Слоты.Добавить(СвойстваСлота);
	
	ДанныеСлотов = Новый Массив;
	ДанныеСлотов.Добавить(ДанныеСотрудника);
	
	Адрес_ДанныеСлотов = ПоместитьВоВременноеХранилище(ДанныеСлотов, ЭтаФорма.УникальныйИдентификатор);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес_ДанныеСлотов"		, Адрес_ДанныеСлотов);
	ПараметрыФормы.Вставить("ПутьКМетаданнымОбработки"	, ПутьКМетаданнымОбработки);

	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = ПутьКМетаданнымОбработки + ".Форма.ФормаОтменыПланирования";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "Освободить_Завершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Освободить_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если СтруктураВозВрата = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	Если Не СтруктураВозВрата.Свойство("РезультатОткрытия") Тогда
		ВозВрат;
	КонецЕсли;
	Если СтруктураВозВрата.РезультатОткрытия <> Истина Тогда
		ВозВрат;
	КонецЕсли;
	Закрыть(СтруктураВозВрата);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступноДляСамозаписи(Команда)
	УстанавливаемыеСвойства = Новый Структура;
	УстанавливаемыеСвойства.Вставить("ДоступноДляСамозаписи"				, Истина);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("Сотрудник"					, Сотрудник);
	СтруктураЭлемента.Вставить("ДатаВремяНачала"			, ДатаВремяНачала);
	СтруктураЭлемента.Вставить("УстанавливаемыеСвойства"	, УстанавливаемыеСвойства);
	
	Если Не УстановкаСвойствЭлементаРасписанияЛКНаСервере(СтруктураЭлемента) Тогда
		ВозВрат;
	КонецЕсли;
	СтруктураВозВрата = Новый Структура;
	СтруктураВозВрата.Вставить("РезультатОткрытия"			, Истина);
	Закрыть(СтруктураВозВрата);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьДоступноДляСамозаписи(Команда)
	УстанавливаемыеСвойства = Новый Структура;
	УстанавливаемыеСвойства.Вставить("ДоступноДляСамозаписи"				, Ложь);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("Сотрудник"					, Сотрудник);
	СтруктураЭлемента.Вставить("ДатаВремяНачала"			, ДатаВремяНачала);
	СтруктураЭлемента.Вставить("УстанавливаемыеСвойства"	, УстанавливаемыеСвойства);
	
	Если Не УстановкаСвойствЭлементаРасписанияЛКНаСервере(СтруктураЭлемента) Тогда
		ВозВрат;
	КонецЕсли;
	СтруктураВозВрата = Новый Структура;
	СтруктураВозВрата.Вставить("РезультатОткрытия"			, Истина);
	Закрыть(СтруктураВозВрата);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановкаСвойствЭлементаРасписанияЛКНаСервере(СтруктураЭлемента) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СвойстваЭлементовРасписанияЛК.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сотрудник			= СтруктураЭлемента.Сотрудник;
	МенеджерЗаписи.ДатаВремяНачала		= СтруктураЭлемента.ДатаВремяНачала;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Сотрудник			= СтруктураЭлемента.Сотрудник;
	МенеджерЗаписи.ДатаВремяНачала		= СтруктураЭлемента.ДатаВремяНачала;
	ОбновитьТаблицу = Ложь;
	ЗаписатьИзменения = Ложь;
	Для каждого УстанавливаемоеСвойство Из СтруктураЭлемента.УстанавливаемыеСвойства Цикл
		Если МенеджерЗаписи[УстанавливаемоеСвойство.Ключ] <> УстанавливаемоеСвойство.Значение Тогда
			ЗаписатьИзменения = Истина;
			ОбновитьТаблицу = Истина;
		КонецЕсли;
		МенеджерЗаписи[УстанавливаемоеСвойство.Ключ] = УстанавливаемоеСвойство.Значение;
	КонецЦикла;
	Если ЗаписатьИзменения Тогда
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			ТекстОшибки = "Ошибка при записи свойств элемента расписания" + Символы.ПС;
			Сообщить(ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВозВрат Ложь;
		КонецПопытки;
	КонецЕсли;

	ВозВрат ОбновитьТаблицу;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиСрочнуюЗапись(Команда)
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("Сотрудник"				, Сотрудник);
	СтруктураЭлемента.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СтруктураЭлемента.Вставить("ИсходнаяСтруктура"		, ИсходнаяСтруктура);
	СтруктураЭлемента.Вставить("Работа"					, Работа);
	СтруктураЭлемента.Вставить("Проект"					, Проект);
	СтруктураЭлемента.Вставить("Автор"					, Автор);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПутьКМетаданнымОбработки", ПутьКМетаданнымОбработки);
	БоР_ОбщийМодульКлиентСервер.ДополнитьСтруктуру(ПараметрыФормы, СтруктураЭлемента);
	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = ПутьКМетаданнымОбработки + ".Форма.ФормаПереносаСрочнойЗаписи";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "ПеренестиСрочнуюЗапись_Завершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСрочнуюЗапись_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если СтруктураВозВрата = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	Если Не СтруктураВозВрата.Свойство("РезультатОткрытия") Тогда
		ВозВрат;
	КонецЕсли;
	Если СтруктураВозВрата.РезультатОткрытия <> Истина Тогда
		ВозВрат;
	КонецЕсли;
	Закрыть(СтруктураВозВрата);

КонецПроцедуры

&НаКлиенте
Процедура Перепланировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		ВозВрат;
	КонецЕсли;
	
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Сотрудник"				, Сотрудник);
	ДанныеСотрудника.Вставить("Слоты"					, Новый Массив);
	
	СвойстваСлота = Новый Структура;
	СвойстваСлота.Вставить("Сотрудник"				, Сотрудник);
	СвойстваСлота.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СвойстваСлота.Вставить("ДатаВремяОкончания"		, ДатаВремяОкончания);
	СвойстваСлота.Вставить("Продолжительность"		, Продолжительность);
	СвойстваСлота.Вставить("Работа"					, ИсходнаяСтруктура.Работа);
	СвойстваСлота.Вставить("Проект"					, ИсходнаяСтруктура.Проект);
	СвойстваСлота.Вставить("Автор"					, ИсходнаяСтруктура.Автор);
	СвойстваСлота.Вставить("Контрагент"				, ИсходнаяСтруктура.Контрагент);
	СвойстваСлота.Вставить("КонтактноеЛицо"			, ИсходнаяСтруктура.КонтактноеЛицо);
	//СвойстваСлота.Вставить("Задание"				, ИсходнаяСтруктура.Задание);
	//СвойстваСлота.Вставить("ПакетЧасов"				, ИсходнаяСтруктура.ПакетЧасов);
	СвойстваСлота.Вставить("Событие"				, ИсходнаяСтруктура.Событие);
	СвойстваСлота.Вставить("КрайнийСрок"			, ИсходнаяСтруктура.КрайнийСрок);
	СвойстваСлота.Вставить("ОписаниеXML"			, ИсходнаяСтруктура.ОписаниеXML);
	СвойстваСлота.Вставить("ОписаниеТекст"			, ИсходнаяСтруктура.ОписаниеТекст);

	ДанныеСотрудника.Слоты.Добавить(СвойстваСлота);
	
	ДанныеСлотов = Новый Массив;
	ДанныеСлотов.Добавить(ДанныеСотрудника);
	
	Адрес_ДанныеСлотов = ПоместитьВоВременноеХранилище(ДанныеСлотов, ЭтаФорма.УникальныйИдентификатор);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес_ДанныеСлотов"		, Адрес_ДанныеСлотов);
	ПараметрыФормы.Вставить("ПутьКМетаданнымОбработки"	, ПутьКМетаданнымОбработки);
	ПараметрыФормы.Вставить("Работа"					, ИсходнаяСтруктура.Работа);
	ПараметрыФормы.Вставить("Проект"					, ИсходнаяСтруктура.Проект);
	ПараметрыФормы.Вставить("Контрагент"				, ИсходнаяСтруктура.Контрагент);
	ПараметрыФормы.Вставить("КонтактноеЛицо"			, ИсходнаяСтруктура.КонтактноеЛицо);
	//ПараметрыФормы.Вставить("Задание"					, ИсходнаяСтруктура.Задание);
	//ПараметрыФормы.Вставить("ПакетЧасов"				, ИсходнаяСтруктура.ПакетЧасов);
	ПараметрыФормы.Вставить("Событие"					, ИсходнаяСтруктура.Событие);
	ПараметрыФормы.Вставить("Автор"						, ИсходнаяСтруктура.Автор);
	ПараметрыФормы.Вставить("Перепланирование"			, Истина);

	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = ПутьКМетаданнымОбработки + ".Форма.ФормаПланирования";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "Перепланировать_Завершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Перепланировать_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если СтруктураВозВрата = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	Если Не СтруктураВозВрата.Свойство("РезультатОткрытия") Тогда
		ВозВрат;
	КонецЕсли;
	Если СтруктураВозВрата.РезультатОткрытия <> Истина Тогда
		ВозВрат;
	КонецЕсли;
	Закрыть(СтруктураВозВрата);

КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВыполнение(Команда)
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("Сотрудник"				, Сотрудник);
	СтруктураЭлемента.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СтруктураЭлемента.Вставить("ИсходнаяСтруктура"		, ИсходнаяСтруктура);
	СтруктураЭлемента.Вставить("Работа"					, Работа);
	СтруктураЭлемента.Вставить("Проект"					, Проект);
	СтруктураЭлемента.Вставить("Автор"					, Автор);
	
	СтруктураЭлемента.Вставить("Контрагент"				, ИсходнаяСтруктура.Контрагент);
	СтруктураЭлемента.Вставить("КонтактноеЛицо"			, ИсходнаяСтруктура.КонтактноеЛицо);
	СтруктураЭлемента.Вставить("ИсходнаяСтруктура"		, ИсходнаяСтруктура);
	СтруктураЭлемента.Вставить("Работа"					, Работа);
	СтруктураЭлемента.Вставить("Проект"					, Проект);
	СтруктураЭлемента.Вставить("Автор"					, Автор);
	СтруктураЭлемента.Вставить("КомментарийЗаписи"		, ИсходнаяСтруктура.КомментарийЗаписи);
	СтруктураЭлемента.Вставить("КонтактныеТелефоны"		, ИсходнаяСтруктура.КонтактныеТелефоны);
	СтруктураЭлемента.Вставить("ДатаВремяОкончания"		, ИсходнаяСтруктура.ДатаВремяОкончания);
	СтруктураЭлемента.Вставить("Продолжительность"		, ИсходнаяСтруктура.Продолжительность);
	//СтруктураЭлемента.Вставить("Задание"				, ИсходнаяСтруктура.Задание);
	//СтруктураЭлемента.Вставить("ПакетЧасов"				, ИсходнаяСтруктура.ПакетЧасов);
	СтруктураЭлемента.Вставить("Событие"				, ИсходнаяСтруктура.Событие);
	СтруктураЭлемента.Вставить("КрайнийСрок"			, ИсходнаяСтруктура.КрайнийСрок);
	СтруктураЭлемента.Вставить("ОписаниеXML"			, ИсходнаяСтруктура.ОписаниеXML);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПутьКМетаданнымОбработки", ПутьКМетаданнымОбработки);
	//Лобашова 29.04.2019 81724 +
	БоР_ОбщийМодульКлиентСервер.ДополнитьСтруктуру(ПараметрыФормы, СтруктураЭлемента);
	
	//документ ВыполнениеРаботы
	Событие = СоздатьИОткрытьДокументОбращение(РежимЗаписиДокумента.Проведение, СтруктураЭлемента) ;
	СтруктураЭлемента.Вставить("Событие"				, Событие);

	РезультатСоздания = СоздатьИОткрытьДокументВыполнениеРаботы(СтруктураЭлемента);
	
	ПараметрыФормы.Вставить("ТолькоПросмотр"	, Ложь);

	ЗначенияЗаполнения =  Новый Структура;
	
	ЗначенияЗаполнения.Вставить("Тема"	, СтруктураЭлемента.КомментарийЗаписи);
	ЗначенияЗаполнения.Вставить("Проект"	, СтруктураЭлемента.Проект);
	ЗначенияЗаполнения.Вставить("Результат"	, ПредопределенноеЗначение("Перечисление.РезультатыКонсультации.ВыполненаРабота"));
	
	СтрокаТрудозатраты = Новый Структура;
	СтрокаТрудозатраты.Вставить("Работа", СтруктураЭлемента.Работа);
	СтрокаТрудозатраты.Вставить("Длительность", СтруктураЭлемента.Продолжительность);
	СтрокаТрудозатраты.Вставить("Пользователь", СтруктураЭлемента.Сотрудник);
	СтрокаТрудозатраты.Вставить("ДатаТрудозатрат", Формат(СтруктураЭлемента.ДатаВремяНачала,"ДЛФ=Д"));
	ЗначенияЗаполнения.Вставить("Трудозатраты"	, СтрокаТрудозатраты);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ИмяФормыДляОткрытия = "Документ." + БоР_ОбщийМодуль.ПолучитьИмяОбъектаПоСсылке(Событие) + ".ФормаОбъекта";
	//ИмяФормыДляОткрытия = ПутьКМетаданнымОбработки + ".Форма.ФормаВыполнения";
	//Лобашова 29.04.2019 81724 -
	ДополнительныеПараметры = Новый Структура;
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "ЗаписатьКлиента_Завершение", ДополнительныеПараметры);
	
	//Лобашова 29.04.2019 81724 +
	Если Не РезультатСоздания.Выполнено Тогда
		ВозВрат ;
	КонецЕсли;
	
	
	//Лобашова 29.04.2019 81724 -
КонецПроцедуры

//Лобашова 30.04.2019 81724 +
&НаСервере
Функция СоздатьИОткрытьДокументОбращение(РежимЗаписи, СтруктураЭлемента);
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТребуетсяСобытие = Ложь;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		ТребуетсяСобытие = Истина;
	КонецЕсли;
	
	Если Не ТребуетсяСобытие Тогда
		ВозВрат Неопределено;
	КонецЕсли;

	 НовоеОбращение = Документы.Обращение.СоздатьДокумент();
	 НовоеОбращение.Тема = "";
	 НовоеОбращение.Дата = ТекущаяУниверсальнаяДата();
	 НовоеОбращение.Заполнить(Неопределено);
	 НовоеОбращение.ТипОбращения = Перечисления.ТипыОбращений.Консультация; //?
	 НовоеОбращение.КаналПолучения = Справочники.КаналыПолученияОбращений.ТелефонГорячейЛинии; //?
	 НовоеОбращение.ОписаниеХранилище = Новый ХранилищеЗначения(СтруктураЭлемента.ОписаниеXML);
	 НовоеОбращение.Сервис = СтруктураЭлемента.Контрагент.Владелец;
	 НовоеОбращение.Инициатор = СтруктураЭлемента.КонтактноеЛицо;
	 НовоеОбращение.Проект = СтруктураЭлемента.Проект;
	 
	 НовоеОбращение.Абонент = СтруктураЭлемента.Контрагент;
	 НовоеОбращение.АбонентОбслуживающейОрганизации = Обслуживание.АбонентОбслуживающейОрганизацииАбонента(НовоеОбращение.Абонент);
	 
	 Документы.Обращение.УстановитьИсполнителяПоУмолчанию(НовоеОбращение);
	 
	 НовоеОбращение.Записать(РежимЗаписи);
	 
	 Событие = НовоеОбращение.Ссылка;
	 
	Возврат Событие;
КонецФункции

&НаСервере
Функция СоздатьИОткрытьДокументВыполнениеРаботы(СтруктураЭлемента) Экспорт
	ТекущаяДата = ТекущаяДата();
	
	МассивДокументов = Новый Массив;
	ДокументОбъект = Документы.ВыполнениеРаботы.СоздатьДокумент();
	ДокументОбъект.Дата						= ТекущаяДата;
	ДокументОбъект.ИсточникСоздания			= "РасписаниеЛК";
	ДокументОбъект.Сотрудник				= СтруктураЭлемента.Сотрудник;
	ДокументОбъект.ДатаВремяНачала			= СтруктураЭлемента.ДатаВремяНачала;
	ДокументОбъект.КомментарийЗаписи		= СтруктураЭлемента.КомментарийЗаписи;
	ДокументОбъект.ДатаВремяНачалаФакт		= СтруктураЭлемента.ДатаВремяНачала;
	ДокументОбъект.ДатаВремяОкончанияФакт	= СтруктураЭлемента.ДатаВремяОкончания;
	ДокументОбъект.ПродолжительностьФакт	= СтруктураЭлемента.Продолжительность;
	ДокументОбъект.ОписаниеXML				= СтруктураЭлемента.ОписаниеXML;
	ДокументОбъект.Автор                    = СтруктураЭлемента.Автор;
	ДокументОбъект.Событие                  = СтруктураЭлемента.Событие;
	ДокументОбъект.ДатаСоздания             = ТекущаяДата;
	МассивДокументов.Добавить(ДокументОбъект);

	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Для каждого ДокументОбъект Из МассивДокументов Цикл
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Исключение
			ОтменитьТранзакцию();
			#Область Вывод_сообщений
			СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
			Если СообщенияПользователю.Количество() > 0 Тогда // есть что сказать
				ТекстОшибки = "";
				Для каждого СообщениеПользователю Из СообщенияПользователю Цикл
					ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + СообщениеПользователю.Текст;
				КонецЦикла;
				Сообщить(ТекстОшибки);
			Иначе
				ТекстОшибки = "Ошибка при создании документа " + ДокументОбъект.Метаданные().Синоним + "" + Символы.ПС;
				Сообщить(ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли;
			#КонецОбласти
			ВозВрат Ложь;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	ОтветФункции =  новый Структура;
	ОтветФункции.Вставить("Выполнено", Истина);
	ОтветФункции.Вставить("ДокументВыполнения", ДокументОбъект.Ссылка);

	ВозВрат ОтветФункции;
КонецФункции
//Лобашова 30.04.2019 81724 -

&НаКлиенте
Процедура ОтразитьВыполнение_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если СтруктураВозВрата = Неопределено Тогда
		ВозВрат;
	КонецЕсли;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	Если Не СтруктураВозВрата.Свойство("РезультатОткрытия") Тогда
		ВозВрат;
	КонецЕсли;
	Если СтруктураВозВрата.РезультатОткрытия <> Истина Тогда
		ВозВрат;
	КонецЕсли;
	Закрыть(СтруктураВозВрата);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяНачалаПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяНачалаПриИзменении(ДатаВремяНачала, ДатаВремяОкончания, Продолжительность, "ДатаВремяНачала");
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяОкончанияПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяОкончанияПриИзменении(ДатаВремяНачала, ДатаВремяОкончания, Продолжительность, "ДатаВремяОкончания", , );
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.УРВ_ПродолжительностьПриИзменении(ДатаВремяНачала, ДатаВремяОкончания, Продолжительность, "Продолжительность", , );
КонецПроцедуры
